sito/app/controllers/bills_controller.rb

SELECT "bills".* FROM "bills"
---
  def index
    @bills = Bill.all

INSERT INTO "bills" ("campaign_id", "created_at", "totale", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["campaign_id", 4], ["created_at", Tue, 10 Dec 2013 14:48:46 UTC +00:00], ["totale", 100], ["updated_at", Tue, 10 Dec 2013 14:48:46 UTC +00:00], ["user_id", 2]]
---
  def create

    @user=current_user
    @bill=@campaign.bills.new(params[:bill])
    @bill.user_id = @user.id

    respond_to do |format|
      if @bill.save

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", "4"]]
---
    def load_campaign
      @campaign= Campaign.find(params[:campaign_id])

SELECT "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT 1  [["id", "7"]]
---
    def set_bill
      @bill = Bill.find(params[:id])