sito/app/controllers/campaigns_controller.rb

  def index
    @campaigns = Campaign.all
---
SELECT "campaigns".* FROM "campaigns"

  def show
    @user=current_user
    @campaign=Campaign.find(params[:id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", "1"]]

  def create

    @campaign = Campaign.new(campaign_params)
    @campaign.user_id = current_user.id

    respond_to do |format|
      if @campaign.save
---
INSERT INTO "campaigns" ("chiusa", "created_at", "descrizione", "durata", "goal", "nome", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @campaign.update(campaign_params)
---
UPDATE "campaigns" SET "durata" = ?, "updated_at" = ? WHERE "campaigns"."id" = 4  [["durata", Tue, 06 Oct 2015], ["updated_at", Tue, 10 Dec 2013 16:01:11 UTC +00:00]]

    def set_campaign
      @campaign = Campaign.find(params[:id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", "4"]]