sito/app/controllers/home_controller.rb

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."chiusa" = 'f' ORDER BY "campaigns"."durata" ASC LIMIT 5
---
    def index
            @campaigns=Campaign.where(chiusa: false).order(:durata).first(5)